/*تعنى الشيفرة  التالية:
عندما تكون  الصفحة جاهزة  نفذ الدالة الاتية وهى شيفرة  رئيسية  نكتبها   عند استخدام  الجيكواري */
$(document).ready(function () {
    $(".first-list-element").addClass("active");
    /** عند تحميل الصفحة الرئيسية فقط اعطيالصنف  اكتف للعنصر ذو الاسم الفيديوهاتالمقترحة */

    $(".nav-item").click(function () {
        $(".nav-item").removeClass("active");
        $(this).addClass("active");
    });

    $("#toggler").click(function(event) {
        $("#wrap").toggleClass('toggled');
        /*بهذا الشكل  سيضيف الصنف "تقلد" للقائمة ذات  المعرف راب عند الضغط على الايقوته ذات المعرف "تقلر"وعند الضغطه الثانية  سوف
    يزيل الصنف "تقلد"من القائمة*/

        var right=$(".sidebar").css('right');
        if(right == '0px'){
            $(".sidebar").css({'right': '-17rem'});
            $(".layer").fadeOut();
            /*هنا يتم تطبيق الشرط في حال كانت القائمة مفتوحة لذلك سوف نغلقها بواسطة التابع سي اس اس*/
            /*fadeOutيُخفي هذا التابع العناصر المطابقة عن طريق تحويلها إلى شفافة تدريجيًا. */
        }
        else{
            $(".sidebar").css({'right':'0'});
            $(".layer").fadeIn();
            /*هنا يطبق الشرط في حال كانت القائمة مغلقة فنفتحها */
            /*fadeIn يعرض هذا التابع العناصر المطابقة عن طريق تحويلها إلى الإعتام
            (opaque، أي لن تصبح شفافةً) تدريجيًا.*/
        }
    });

    $(".layer").click(function(e) {
        $(".sidebar").css({'right': '-17rem'});
        $(".layer").fadeOut();
    });/*حتى تختفي القائمة الجانبية عند الضغط على الخلفية السوداء*/

    $(".search-icon").click(function () {
        $(".search-input").slideToggle("slow");
        /*slideToggle يودى الى  اخفاء واظهار العنصر باسلوب جميل*/
    });
});
/*$( document ).ready(function() { // هنا لإنشاء فانكشن بعد تحميل الصفحة مباشراً
    $(".nav-item").click(function(){ // هنا إنشاء فانكشن عند الضغط على هذا الكلاس وهو كلاس العنصر في النافبار
		$(".nav-item")..removeClass( 'active' ); // هنا حذف كلاس active من جميع عناصر النافبار
      	$(this).addClass( 'active' );// وإضافة الكلاس إلى العنصر الذي ضغط علية فقط
	})
});*/
